[
  {
    "id": 1,
    "title": "Booki",
    "titleproject": "Page d'accueil d'une agence de voyage",
    "description": "Ce projet consistait à intégrer la page d'accueil d'une agence de voyage en suivant une maquette fournie sur Figma. Le but principal était de reproduire fidèlement le design en HTML et CSS, tout en s'assurant que l'interface soit responsive pour s'adapter à différents formats (mobile, tablette, desktop).",
    "technologie": "HTML / CSS",
    "fonctionnalite": [
      "Reproduction fidèle des maquettes Figma pour plusieurs formats d'écran.",
      "Mise en place d’un design responsive, assurant une expérience utilisateur fluide sur mobile, tablette et desktop.",
      "Utilisation des bonnes pratiques pour structurer et styliser le code (sémantique HTML et CSS)."
    ],
    "lien": "https://github.com/Emmaplt/Booki_Projet2_Plaut_Emma.git",
    "retour": "Ce projet m’a permis de maîtriser l'intégration de maquettes responsives et de me familiariser avec les outils essentiels pour un développeur frontend. Cela a renforcé ma capacité à écrire un code propre et à respecter les exigences de design.",
    "picture": "https://Emmaplt.github.io/mon-portfolio/assets/images/booki-picture.png",
    "cover": "https://Emmaplt.github.io/mon-portfolio/assets/images/booki-card.png",
    "illustration1": "https://Emmaplt.github.io/mon-portfolio/assets/images/illustration-1-booki.png",
    "backgroundGlobal": "#f2fcff",
    "backgroundContent": "#c0d9ff"
  },
  {
    "id": 2,
    "title": "Sophie Bluel",
    "titleproject": "Portfolio architecte",
    "description": "Dans ce projet, j'ai développé un site dynamique pour une architecte d'intérieur, Sophie Bluel. L'objectif principal était de manipuler le DOM avec JavaScript et de communiquer avec une API pour gérer l'affichage des travaux, les interactions utilisateur, et les fonctionnalités d'administration.",
    "technologie": "HTML / CSS, JavaScript, Swagger",
    "fonctionnalite": [
      "Authentification utilisateur : Une page de connexion sécurisée pour l’administrateur du site.",
      "Filtres dynamiques : Filtrage des travaux de l’architecte en fonction de leur catégorie.",
      "Mode administrateur : Une interface accessible après connexion pour modifier le portfolio avec la suppression de photos et l’ajout de nouvelles photos via une modale."
    ],
    "lien": "https://github.com/Emmaplt/Portfolio-architecte-sophie-bluel-master.git",
    "retour": "Ce projet m'a permis de consolider mes compétences en JavaScript, notamment en manipulant le DOM pour rendre la page dynamique et interactive. La communication avec une API REST et le développement de fonctionnalités comme l'authentification et la gestion des médias m'ont offert une expérience pratique essentielle pour devenir une développeuse front-end complète.",
    "picture": "https://Emmaplt.github.io/mon-portfolio/assets/images/sophie-picture.png",
    "cover": "https://Emmaplt.github.io/mon-portfolio/assets/images/sophie-card.png",
    "illustration1": "https://Emmaplt.github.io/mon-portfolio/assets/images/illustration-1-sophie.png",
    "illustration2": "https://Emmaplt.github.io/mon-portfolio/assets/images/illustration-2-sophie.png",
    "backgroundGlobal": "#ffffff",
    "backgroundContent": "#e1eae8"
  },
  {
    "id": 3,
    "title": "Nina Carducci",
    "titleproject": "Site de photographe",
    "description": "Ce projet consistait à analyser, déboguer et optimiser le site de Nina Carducci, photographe professionnelle, afin d'améliorer ses performances, son accessibilité, et son référencement SEO. À l’aide d’outils comme Lighthouse et Wave, j’ai réduit les temps de chargement, corrigé les erreurs d’accessibilité et optimisé la structure pour un meilleur référencement.",
    "technologie": "HTML / CSS, JavaScript, Lighthouse, Wave, Outils SEO",
    "fonctionnalite": [
      "Optimisation des images : Compression et mise en place des formats adaptés.",
      "Amélioration des performances : Réduction des temps de chargement via des optimisations de code et de ressources.",
      "Accessibilité renforcée : Correction des erreurs détectées par Wave et amélioration de la navigation.",
      "SEO : Révision des balises (title, meta description, alt), structure du contenu et hiérarchie des titres."
    ],
    "lien": "https://github.com/Emmaplt/Nina-Carducci-Dev-master.git",
    "retour": "Ce projet m’a permis de perfectionner mes compétences en optimisation web, notamment en utilisant des outils comme Lighthouse et Wave. J'ai appris à détecter et résoudre des problèmes affectant les performances, l'accessibilité et le SEO d'un site, des aspects essentiels pour améliorer la visibilité et l'expérience utilisateur.",
    "picture": "https://Emmaplt.github.io/mon-portfolio/assets/images/nina-picture.png",
    "cover": "https://Emmaplt.github.io/mon-portfolio/assets/images/nina-card.png",
    "illustration1": "https://Emmaplt.github.io/mon-portfolio/assets/images/illustration-nina.png",
    "backgroundGlobal": "#fff9f3",
    "backgroundContent": "#efd7c1"
  },
  {
    "id": 4,
    "title": "Kasa",
    "titleproject": "Application web de location immobilière",
    "description": "Dans ce projet, j’ai développé le front-end de Kasa, une application web de location immobilière, en utilisant React et React Router. Le but était de créer une interface moderne et réactive, basée sur des maquettes fournies, tout en manipulant des données simulées depuis un fichier JSON.",
    "technologie": "React, React Router, SASS, Node.js",
    "fonctionnalite": [
      "Navigation fluide et dynamique entre les pages grâce à React Router.",
      "Gestion des données dynamiques provenant d’un fichier JSON.",
      "Intégration d’animations et d’un design responsive pour une meilleure expérience utilisateur."
    ],
    "lien": "https://github.com/Emmaplt/projet-kasa.git",
    "retour": "Ce projet m’a permis de consolider mes compétences en React, notamment la gestion des composants et des états, ainsi qu’en navigation avec React Router. J’ai également approfondi mes connaissances en SASS pour créer des interfaces soignées et interactives, tout en apprenant à structurer efficacement une application web moderne.",
    "picture": "https://Emmaplt.github.io/mon-portfolio/assets/images/kasa-picture.png",
    "cover": "https://Emmaplt.github.io/mon-portfolio/assets/images/kasa-card.png",
    "illustration1": "https://Emmaplt.github.io/mon-portfolio/assets/images/illustration-1-kasa.png",
    "illustration2": "https://Emmaplt.github.io/mon-portfolio/assets/images/illustration-2-kasa.png",
    "backgroundGlobal": "#fff9f3",
    "backgroundContent": "#efd7c1"
  },
  {
    "id": 5,
    "title": "Mon Vieux Grimoire",
    "titleproject": "Développement Back-End d’un site de notation de livres",
    "description": "Dans ce projet, j’ai développé le back-end de Mon Vieux Grimoire, un site permettant aux utilisateurs de noter des livres. En utilisant Node.js, Express, et MongoDB, j’ai créé un serveur performant et sécurisé, avec des fonctionnalités essentielles comme la gestion des livres et des notations.",
    "technologie": "Node.js / Express, MongoDB / Mongoose, JWT, bcrypt, dotenv",
    "fonctionnalite": [
      "CRUD complet : Création, lecture, mise à jour, et suppression des livres et notations.",
      "Système d’authentification : Gestion des utilisateurs avec un système de connexion sécurisé.",
      "Téléchargement d’images : Gestion et optimisation des images associées aux livres.",
      "Calcul des notes moyennes : Fonctionnalité pour évaluer la qualité des livres.",
      "Architecture MVC : structure organisée pour faciliter la maintenance et l’évolution de l’application."
    ],
    "lien": "https://github.com/Emmaplt/Projet-backend.git",
    "retour": "Ce projet m’a permis de développer mes compétences en développement back-end, notamment en manipulant MongoDB avec Mongoose et en implémentant des API RESTful sécurisées. J’ai également approfondi mes connaissances en authentification et sécurité des données, tout en apprenant à structurer une application avec l’architecture MVC pour une meilleure maintenabilité.",
    "picture": "https://Emmaplt.github.io/mon-portfolio/assets/images/grimoire-picture.png",
    "cover": "https://Emmaplt.github.io/mon-portfolio/assets/images/grimoire-card.png",
    "illustration1": "https://Emmaplt.github.io/mon-portfolio/assets/images/illustration-grimoire.png",
    "backgroundGlobal": "#fff9f3",
    "backgroundContent": "#efd7c1"
  },
  {
    "id": 6,
    "title": "Qwenta",
    "titleproject": "Planification du développement",
    "description": "Ce projet portait sur la planification complète du développement d’un site web de création de menus pour restaurateurs, sans intervention directe dans le codage. J’ai travaillé sur l’analyse des besoins, la rédaction des spécifications techniques, et la gestion de projet à l’aide d’un tableau Kanban. Une veille technologique a également été réalisée pour identifier les solutions adaptées aux objectifs du projet.",
    "technologie": "Notion, Feedly et User Stories",
    "fonctionnalite": [
      "Découpage des fonctionnalités en tâches précises pour préparer le développement.",
      "Rédaction des spécifications techniques à partir des besoins fonctionnels.",
      "Mise en place d’une méthode de veille technologique pour rester à jour sur les solutions possibles.",
      "Création d’un tableau Kanban pour suivre le déroulement du projet.",
      "Présentation de la solution technique avec des recommandations concrètes."
    ],
    "retour": "Ce projet m’a permis de renforcer mes compétences en gestion de projet et en rédaction technique, tout en développant ma capacité à traduire des besoins fonctionnels en tâches claires et organisées. J’ai également appris à utiliser des outils de veille technologique pour proposer des solutions innovantes et adaptées.",
    "picture": "https://Emmaplt.github.io/mon-portfolio/assets/images/qwenta-picture.png",
    "cover": "https://Emmaplt.github.io/mon-portfolio/assets/images/qwenta-card.png",
    "illustration1": "https://Emmaplt.github.io/mon-portfolio/assets/images/illustration-qwenta.png",
    "backgroundGlobal": "#fff9f3",
    "backgroundContent": "#efd7c1"
  }
]